{
  "meta": {
    "theme": "elegant"
  },
  "basics": {
    "name": "Daniel McNerthney",
    "label": "Mobile Software Engineer",
    "image": "https://avatars.githubusercontent.com/u/204389",
    "summary": "A team leader dedicated to crafting outstanding, testable, reusable, and maintainable code. Demonstrates a strong ability to design superior software solutions through close collaboration with team members and stakeholders. Fosters a culture of continuous improvement and innovation, ensuring the delivery of high-quality, scalable, and efficient outcomes. Leads by example in adopting best practices, implementing robust testing strategies, and promoting code reviews to maintain high standards. Engages in proactive problem-solving and provides mentorship to team members, enhancing their skills and fostering a cohesive and productive work environment. Balances technical excellence with a keen understanding of business requirements, delivering software that not only meets but exceeds expectations.",
    "email": "dan.mcnerthney@gmail.com",
    "location": {
      "city": "Hood River",
      "state": "Oregon",
      "countryCode": "US"
    },
    "profiles": [
      {
        "url": "https://www.linkedin.com/in/danielmcnerthney",
        "network": "linkedin"
      },
      {
        "url": "https://github.com/mcnerthney",
        "username": "mcnerthney",
        "network": "github"
      },
      {
        "url": "https://www.instagram.com/dmcnerthney",
        "username": "dmcnerthney",
        "network": "instagram"
      }
    ]
  },
  "references": [],
  "skills": [
    {
      "keywords": [
        "Kotlin",
        "Java",
        "Android Jetpack",
        "Compose",
        "Flow",
        "LiveData",
        "Kotlin Multiplatform",
        "Ktor",
        "Coroutines",
        "Kotlin Serialization",
        "gGradle",
        "Room",
        "Room DAO/Migation","SQLite"
      ],
      "level": "Senior",
      "name": "Android Engineer"
    },
    {
      "keywords": [
        "Node.js",
        "Tailwind CSS",
        "JavaScript",
        "TypeScript",
        "mongodb"
      ],
      "level": "Hobby",
      "name": "Web Developer"
    }
  ],
  "work": [
    {
      "summary": "Tapcart effortlessly transform Shopify stores into dynamic mobile applications with adaptive server-driven UI using the power of Jetpack's components including Compose, Flow, Navigation, ViewModels, and Room. Additionally, I utilized the capabilities of Dagger for dependency injection, Ktor for network communication, GraphQL for efficient data querying, and JSON for data interchange.",
      "website": "https://tapcart.com",
      "name": "Tapcart",
      "location": "Santa Monica, California",
      "position": "Senior Android Software Engineer II",
      "startDate": "2021-09-20",
      "endDate": "2024-10-08",
      "highlights": [
        "Built the Android WebBridge SDK providing an asynchronous communication channel for WebView interfaction with the Native Android application.",
        "Designed and implentented Tapcart Mobile Wishlist for Android. Providles feature parity with Tapcart iOS App, enabling local and remote lists of favorate products.",
        "Integrated a variety of third-party APIs and SDKs including LaunchDarkly, AppsFlyer, Symn, Algolia, Yotpo, Klaviyo, AppsFlyer, and Firebase"
      ]
    }
  ],
  "interests": [
    {
      "name": "Rock Climb, Gravel Bike, Photography, Camping"
    }
  ]
}